Certification/src/Documents/ПриглашениеДляРегистрации/ПриглашениеДляРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриглашениеДляРегистрации</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПриглашения</name>
    <type>
      <types>EnumRef.ВидыПриглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
</mdclass:Document>

Certification/src/Documents/ПриглашениеДляРегистрации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Отправляет письмо о приглашении пользователя в сервис
//
// Параметры:
//	Приглашение - Структура, ДокументСсылка.ПриглашениеДляРегистрации - объект, по которому отправляется письмо.
//
Процедура ОтправитьПисьмоПоПриглашению(Приглашение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Приглашение)) Тогда
			
		ДанныеСервиса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Приглашение, 
			Новый Структура("Сервис, Витрина", "Сервис", "Сервис.ОсновнаяВитрина"));
		ДанныеКонтакта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Приглашение, 
			Новый Структура("Адрес, Представление, Контакт","АдресЭлектроннойПочты", "ПолноеИмяПользователя", "Пользователь")); 
	Иначе
		ДанныеСервиса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Приглашение.Сервис, 
			Новый Структура("Сервис, Витрина", "Ссылка", "ОсновнаяВитрина"));
			
		ДанныеКонтакта = Новый Структура;
		ДанныеКонтакта.Вставить("Адрес", Приглашение.АдресЭлектроннойПочты);
		ДанныеКонтакта.Вставить("Представление", Приглашение.ПолноеИмяПользователя);
		ДанныеКонтакта.Вставить("Контакт", Приглашение.Пользователь);
		
	КонецЕсли;
    
    УчетнаяЗапись = ВзаимодействияУСП.УчетнаяЗаписьПоддержки(ДанныеСервиса.Сервис, ДанныеСервиса.Витрина);
    
    Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение НСтр("ru='Не установлена учетная запись для отправки писем.'");
	КонецЕсли; 
    
    ШаблонПисьма = Справочники.ШаблоныТекстов.ШаблонПоТипу(
        Справочники.ТипыШаблоновТекстов.ПисьмоОтправкаПриглашенияНаРегистрацию,
        ДанныеСервиса.Сервис, ДанныеСервиса.Витрина);
	
	// тут нужно программно создать электронное письмо
	ПараметрыОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "ИмяПользователя, АдресЭлектроннойПочты");
    ТаблицаКартинок = Новый ТаблицаЗначений; // Для сохранения вложений картинок
	Письмо = ВзаимодействияУСП.ЗаготовкаИсходящегоПисьма(ШаблонПисьма, Приглашение, УчетнаяЗапись, ТаблицаКартинок);
	Письмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
	Письмо.УдалятьПослеОтправки = Истина;
    ВзаимодействияУСП.ДобавитьПолучателяПисьма(Письмо, ДанныеКонтакта);	
	Письмо.Записать();
    ВзаимодействияУСП.ДобавитьКартинкиВПисьмо(Письмо, ТаблицаКартинок);
    ВзаимодействияУСП.УстановитьПредметПисьма(Письмо, Приглашение);
    
    ВзаимодействияУСП.ОтправитьПисьмо(Письмо, СобытиеЖурналаРегистрацииОтправкаПисьмаИзПриглашенияНаРегистрацию());
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СобытиеЖурналаРегистрацииОтправкаПисьмаИзПриглашенияНаРегистрацию() Экспорт
    
    Возврат НСтр("ru='Отправка письма из приглашения на регистрацию'", 
                 ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());    
    
КонецФункции

#КонецОбласти 

#КонецЕсли
